/*
  Задания на лабораторную работу приводятся в каждом варианте. При написании программ
  можно использовать как динамические, так и нединамические массивы. Размерность последних
  задаѐтся именованной константой.

  Вариант 12
    В одномерном массиве, состоящем из n вещественных элементов, вычислить:
    1. номер максимального по модулю элемента массива;
    2. сумму модулей элементов массива, расположенных после первого положительного
    элемента.
  Преобразовать массив таким образом, чтобы сначала располагались все элементы, целая
  часть которых лежит в интервале 𝑎, 𝑏 , а потом – все остальные.

*/

#include <iostream>
#include "lib.h"

using namespace std;

int main() {
	// смена кодировки
  system("chcp 65001");

	return 0;
}
