/*
  Составить две программы, первая из которых вводит составные части структуры данных,
  приведѐнной в индивидуальном варианте, как десятичные числа и формирует из них заданную
  упакованную структуру как 16-ричное число. Вторая программа вводит упакованную структуру
  как 16-ричное число и выводит значения отдельных еѐ составных частей как десятичные числа.
*/

#include <stdio.h>
#include <stdlib.h>
#include <locale.h> // Для смены языка
#include <math.h>   // Математические функции и константы

int main() {
  // смена кодировки
  system("chcp 65001");

  return 0;
}
